<a href="https://colab.research.google.com/github/jingjielim345/template-repo/blob/master/02_DACPython101_2020_Pandas_TimeSeries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas
Think of pandas as an extremely powerful version of Excel, with a lot more features.

# Data Frames
DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [1]:
#import pandas and numpy
import pandas as pd
import numpy as np

In [2]:
 from numpy.random import randn
np.random.seed(101)
#we use seed behind just to make sure we have the same number

In [3]:
# creating a data frame
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# New Section

## Selection and Indexing

In [12]:
# taking out one of the column (make sure to be in CAPS since it's case sensitive) it's a float since it's' decimal
df["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
# to show what type of dataframe it is, its a series of number , hence it's a series
type(df['W'])

pandas.core.series.Series

In [15]:
# alternative, but not recommended as theres a whole lot of function following df. and pandas will get confused
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [8]:
# selecting multiple columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

hence we can observe that if we only select a column, we will get a series, but if theres more than one column we will have a dataframe

In [9]:
# creating a new column, you can define and add in at the same time
df['new'] = df['W'] + df['Y']

In [10]:
# check if new column is created 
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [11]:
# lets try dropping the 'new 'column 
df.drop ('new')

KeyError: ignored

In [16]:
# to drop a column, we need to let pandas know if it belong as col or row
df.drop('new' , axis=1)
# why axis=one ? cause it refers to the column, by default when you don't type anything its 0, which refers to the index aka row

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# note that the column isn't removed from the main dataframe, what do we do?
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
# we use the "inplace" argument to be set to true, why so? this is to prevent accidental loss of data. 
df.drop('new' , axis=1 , inplace =True )

In [19]:
#lets check out data frame again 
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
# we can also use it to drop the row 
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [21]:
# since data frames are just a data marker on top of a NumPy array. To show, we do
df.shape

(5, 4)

its similar to numpy matrix, we can see that our dataframe is a tuple , two dimensional matrix. at the "0" position/index it shows the row, and on index "1" it shows the number of column. Hence, the axis.

Now , let's take a look at rows

In [22]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df.loc['A']
# take note that it returns a series

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [25]:
# we can also call a row by its index position , even if the row are labeled by a string
# a string is just words/alphabet
df.iloc[4]

W    0.190794
X    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

we can see that theres 2 ways of selecting the rows, first way is via the row name, second is via their numerical index

In [30]:
# selecting a specific row and column
df.loc['E', 'X']

1.9787573241128278

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# selecting a subset from our dataframe , first bracket holds the entire set, 2nd bracket selects the row/column 
df.loc[ ['A', 'B'], ['Z','Y']]

          Z         Y
A  0.503826  0.907969
B  0.605965 -0.848077

In [33]:
# conditional selection using operators
df > 0
#boolean values are reutrned T/F

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [34]:
# we can then define it
booldf = df > 0 
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [35]:
# if we were to ask python to show us the values that are true, we type: 
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [36]:
# alternatively we can also do this
df [ df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

look at the condition corrosponding to the dataframe

In [ ]:
# however if we were to only pass it through a series, we observe that there is no NaN value as we are not touching the whoel dataframe
df [df['W'] >0 ]

doing this is helpful when lets say you are working on first level filtering, eg. selecting students who are from SIM in SIM DS

In [ ]:
# now we can define the manipulated dataframe
resultdf = df[df['W'] >0]
resultdf

In [ ]:
#now if i wanna select the col 'X'
resultdf['X']

In [ ]:
# heres a short cut by stacking the commands, we dont even need to define it
df[df['W'] >0]['X']

In [ ]:
# if i want 2 col, 
df[df['W'] >0][['X','Y']]

In [ ]:
#multiple conditions, 'and'
df[(df['W']>0) & (df['Y']> 1)]

In [ ]:
#multiple conditions, 'or'
df[(df['W']>0) | (df['Y']> 1)]

# Introduction to Time Series with Pandas

A lot of our financial data will have a datatime index, so let's learn how to deal with this sort of data with pandas!

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
#python built in date and time lib
from datetime import datetime

In [ ]:
# To illustrate the order of arguments
my_year = 2017
my_month = 1
my_day = 2
my_hour = 13
my_minute = 30
my_second = 15

In [ ]:
# January 2nd, 2017
my_date = datetime(my_year,my_month,my_day)

In [ ]:
# Defaults to 0:00 , hence the last two 0 behind
my_date

In [ ]:
# January 2nd, 2017 at 13:30:15
my_date_time = datetime(my_year,my_month,my_day,my_hour,my_minute,my_second)

In [ ]:
my_date_time

You can grab any part of the datetime object you want

In [ ]:
my_date.day

In [ ]:
my_date_time.hour

### Pandas with Datetime Index

You'll usually deal with time series as an index when working with pandas dataframes obtained from some sort of financial API. Fortunately pandas has a lot of functions and methods to work with time series!

In [ ]:
# Create an example datetime list/array
first_two = [datetime(2016, 1, 1), datetime(2016, 1, 2)]
first_two

In [ ]:
# Converted to an index
dt_ind = pd.DatetimeIndex(first_two)
dt_ind

In [ ]:
# Attached to some random data, number will be different 
data = np.random.randn(2,2)
print(data)
cols = ['A','B']

In [ ]:
df = pd.DataFrame(data,dt_ind,cols)

In [ ]:
df

In [ ]:
df.index

In [ ]:
# Latest Date Location 
df.index.argmax()

In [ ]:
df.index.max()

In [ ]:
# Earliest Date Index Location
df.index.argmin()

In [ ]:
df.index.min()

## Rolling and Expanding

A very common process with time series is to create data based off of a rolling mean. Let's show you how to do this easily with pandas!

In [ ]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
# Best way to read in data with time series index!
df = pd.read_csv('walmart_stock.csv')

In [ ]:
df.head()

In [ ]:
df['Open'].plot(figsize=(16,6))

Now let's add in a rolling mean! This rolling method provides row entries, where every entry is then representative of the window.

In [ ]:
# 7 day rolling mean
df.rolling(7).mean().head(20)

In [ ]:
df['Open'].plot()
df.rolling(window=30).mean()['Close'].plot()

Easiest way to add a legend is to make this rolling value a new column, then pandas does it automatically!

In [ ]:
df['Close: 30 Day Mean'] = df['Close'].rolling(window=30).mean()
df[['Close','Close: 30 Day Mean']].plot(figsize=(16,6))

## expanding

Now what if you want to take into account everything from the start of the time series as a rolling value? For instance, not just take into account a period of 7 days, or monthly rolling average, but instead, take into everything since the beginning of the time series, continuously:

In [ ]:
# Optional specify a minimum number of periods
df['Close'].expanding(min_periods=1).mean().plot(figsize=(16,6))